src/fixtures/siri_et_xml_tn/trip_removal.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:siri="http://wsdl.siri.org.uk" xmlns:siri1="http://www.siri.org.uk/siri" xmlns:acsb="http://www.ifopt.org.uk/acsb" xmlns:ifop="http://www.ifopt.org.uk/ifopt">
   <soapenv:Header/>
   <soapenv:Body>
      <siri:NotifyEstimatedTimetable>
         <ServiceDeliveryInfo>
            <siri1:ResponseTimestamp>2022-01-17T09:30:46+02:00</siri1:ResponseTimestamp>
            <siri1:ProducerRef>CBOX</siri1:ProducerRef>
         </ServiceDeliveryInfo>
         <Notification>
            <siri1:EstimatedTimetableDelivery version="2.0">
               <siri1:ResponseTimestamp>2022-01-17T09:30:46+02:00</siri1:ResponseTimestamp>
               <siri1:SubscriberRef>Navitia</siri1:SubscriberRef>
               <siri1:EstimatedJourneyVersionFrame>
                  <siri1:RecordedAtTime>2022-01-17T09:30:00+02:00</siri1:RecordedAtTime>
                  <siri1:EstimatedVehicleJourney>
                     <siri1:LineRef>STIF:Line::C01727:</siri1:LineRef>
                     <siri1:PublishedLineName xml:lang="fr">Mon libellé de ligne</siri1:PublishedLineName>
                     <siri1:DirectionRef>Outbound</siri1:DirectionRef> <!-- valeur en dur -->
                     <siri1:EstimatedVehicleJourneyCode>SNCF_ACCES_CLOUD:VehicleJourney::ef7c2657-c9eb-4fd2-8571-f5831ea4d59b:LOC</siri1:EstimatedVehicleJourneyCode>
                     <siri1:Cancellation>true</siri1:Cancellation>
                     <siri1:JourneyPatternName>PIKO</siri1:JourneyPatternName>
                     <siri1:VehicleMode>rail</siri1:VehicleMode> <!-- bus ou rail ou tram -->
                     <siri1:OriginRef>?</siri1:OriginRef>
                     <siri1:OriginName xml:lang="?">?</siri1:OriginName>
                     <siri1:DestinationRef>?</siri1:DestinationRef>
                     <siri1:DestinationName xml:lang="?">?</siri1:DestinationName>
                     <siri1:OperatorRef>800</siri1:OperatorRef>
                     <siri1:ProductCategoryRef>suburbanRailway</siri1:ProductCategoryRef> <!--
                     	mode avancé : bus, railShuttle (CDGVal et OrlyVal), suburbanRailway (trains TN),
                     	regionalRail (TER), interregionalRail (intercités), local (RER), tram -->
                     <siri1:TrainNumbers>
                     	<siri1:TrainNumberRef>155840-155841</siri1:TrainNumberRef>
                     </siri1:TrainNumbers>
                     <siri1:VehicleJourneyName>148836-148837</siri1:VehicleJourneyName>
                     <siri1:OriginAimedDepartureTime>2021-11-22T14:06:10.000Z</siri1:OriginAimedDepartureTime>
                     <siri1:DestinationAimedArrivalTime>2021-11-22T14:06:10.000Z</siri1:DestinationAimedArrivalTime>
                     <siri1:RecordedCalls>
                     <!-- liste des horaires déjà passés -->
                     </siri1:RecordedCalls>
                     <siri1:EstimatedCalls>
                     <!-- liste des horaires à venir -->
                     </siri1:EstimatedCalls>
                  </siri1:EstimatedVehicleJourney>
               </siri1:EstimatedJourneyVersionFrame>
            </siri1:EstimatedTimetableDelivery>
         </Notification>
      </siri:NotifyEstimatedTimetable>
   </soapenv:Body>
</soapenv:Envelope>
